# 05. Data Analysis: Preliminar Analysis

**In this notebook** we will start working with a real dataset - `codename` titanic.

In [1]:
!cat "./data/titanic/Titanic Description.txt"

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

#### Data Loading with Pandas

In [2]:
import pandas as pd

In [3]:
import os
titanic_dataset = os.path.join(os.path.abspath(os.path.curdir), 'data', 'titanic', 'titanic3.csv')
data = pd.read_csv(titanic_dataset)

In [4]:
data.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [5]:
data.tail(8)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [6]:
data.shape

(1309, 14)

←←←←←←←←←←←←←←←←←←←←← stopped here

In [22]:
data.columns.values

array(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype=object)

In [21]:
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

Now let's have a closer look at the (numerical) data

In [11]:
data.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [12]:
data.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

## Handling missing values

As likely expected, `pandas` provides a lot of built-in functions to handle with most common operations on data. 

One of these operation is about **missing data**. 

We will be using the `isnull` and `notnull` functions on the `body` column of the DataFrame.

As always, if you would like to have a closer look at the documentation, Jupyter notebook can help you with that:

In [ ]:
help(pd.isnull)

In [ ]:
pd.isnull(data["body"])

In [ ]:
help(pd.notnull)

In [ ]:
pd.notnull(data["body"])

To extract the values out of a `pandas` Series or DataFrame, we can call the `values` function.

The `values` function will return the data as **Numpy** Array.

In [ ]:
values = pd.isnull(data["body"]).values

In [ ]:
values.sum()

We do the same with **Not-null** values

In [ ]:
pd.notnull(data["body"]).values.sum()

Understanding how many null values are present is important for further analysis. 
In this case, we have two options:

- substitute null values with other values
- get rid of all of them

#### Get rid of Null values

In [ ]:
data.dropna(axis=0, how="all")

**Note**: the `dropna` function does **not** modify the original DataFrame. It returns a **new** DataFrame, instead. 

To apply the function **in place**, we should pass the `inplace=True` parameter to the `dropna` function:

```python
data.dropna(axis=0, how='any', inplace=True)
```

Moreover, we can also change the **axis** on which we would like to perform the operation:

In [ ]:
data_dropna = data.dropna(axis=1, how='any')

In [ ]:
data_dropna.head()

#### Filling the Null Values

Similarly, we can use the `fillna` function to replace all null values found in the Data Frame.

In [ ]:
data_fill = data.fillna(0)

In [ ]:
data_fill.head()

In [ ]:
data_fill_label = data.fillna("UNKNOWN")
data_fill_label.tail(5)

We can also apply these functions to specific target **Series** rather than the entire Data Frame.

This would avoid inconsistencies in the data types of columns:

In [ ]:
data_clean = data # make a copy
data_clean["body"] = data_clean["body"].fillna(0)
data_clean["home.dest"] = data_clean["home.dest"].fillna("UNKNOWN")
data_clean.tail(10)

In [ ]:
pd.isnull(data_clean["age"]).values.sum()

As for the column `age` we are going to replace the null values with the mean.

In [ ]:
data_clean["age"].fillna(data_clean["age"].mean())

In [ ]:
data_clean["age"][1291]

In [ ]:
data_clean["age"].fillna(method="ffill")

In [ ]:
data_clean["age"].fillna(method="backfill")

# Variables dummy

Tipically, Machine Learning algorithm like to ingest numerical features - so features like strings has to be changed into numerical (_aka categorical_) ones in order to be used.

To do so, we will leverage on the `get_dummies` pandas function

In [ ]:
help(pd.get_dummies)

In [ ]:
data["sex"].head(10)

In [ ]:
dummy_sex = pd.get_dummies(data["sex"], prefix="sex")

In [ ]:
dummy_sex.head(10)

In [ ]:
column_name=data.columns.values.tolist()
column_name

In [ ]:
data = data.drop(["sex"], axis = 1)

In [ ]:
data = pd.concat([data, dummy_sex], axis = 1)

In [ ]:
def createDummies(df, var_name):
    dummy = pd.get_dummies(df[var_name], prefix=var_name)
    df = df.drop(var_name, axis = 1)
    df = pd.concat([df, dummy ], axis = 1)
    return df

In [ ]:
createDummies(data_clean, "sex")